
{
  "quiz": {
    "questions": [
      { "id": "q1", "text": "Ele inclui você em planos de médio ou longo prazo?", "category": "investimento", "weight": 3, "reverse": true },
      { "id": "q2", "text": "Ele demonstra iniciativa para marcar encontros?", "category": "investimento", "weight": 2, "reverse": true },
      { "id": "q3", "text": "As respostas às suas mensagens são rápidas e consistentes?", "category": "consistencia", "weight": 2, "reverse": true },
      { "id": "q4", "text": "Você sente que precisa puxar a energia da relação?", "category": "reciprocidade", "weight": 3, "reverse": false },
      { "id": "q5", "text": "Ele compartilha detalhes da rotina espontaneamente?", "category": "reciprocidade", "weight": 2, "reverse": true },
      { "id": "q6", "text": "Ele demonstra curiosidade genuína sobre sua vida?", "category": "reciprocidade", "weight": 2, "reverse": true },
      { "id": "q7", "text": "Ele mantém contato mesmo quando está ocupado?", "category": "consistencia", "weight": 2, "reverse": true },
      { "id": "q8", "text": "Ele demonstra desconforto quando você reduz levemente a disponibilidade?", "category": "reciprocidade", "weight": 2, "reverse": true },
      { "id": "q9", "text": "Ele demonstra orgulho ao ser visto com você?", "category": "prioridade", "weight": 2, "reverse": true },
      { "id": "q10", "text": "Ele propõe planos com antecedência ou sempre decide na última hora?", "category": "prioridade", "weight": 3, "reverse": true },
      { "id": "q11", "text": "Ele demonstra esforço quando percebe que pode te perder?", "category": "investimento", "weight": 3, "reverse": true },
      { "id": "q12", "text": "Você sente estabilidade ou imprevisibilidade constante na atitude dele?", "category": "consistencia", "weight": 3, "reverse": false }
    ],
    "answerScores": {
      "yes": 100,
      "sometimes": 50,
      "no": 0
    }
  },
  "messageTemplates": {
    "Curiosidade": [
      "Vi algo que me lembrou de você hoje.",
      "Estava pensando em uma coisa que você comentou...",
      "Acabei de ver uma notícia e lembrei daquela nossa conversa.",
      "Engraçado como certas músicas trazem memórias específicas, né?",
      "Você não vai acreditar no que aconteceu, tem tudo a ver com o que falamos."
    ],
    "Distância": [
      "Focando um pouco mais em mim esses dias. Está sendo ótimo.",
      "Vida corrida por aqui, mas tudo caminhando bem.",
      "Aproveitando o silêncio para colocar as ideias no lugar.",
      "Às vezes o afastamento é o melhor filtro para entender o que é real.",
      "Seguindo meu ritmo, sem pressa e com muita clareza."
    ],
    "Limite": [
      "Entendo seu ponto, mas não me sinto confortável com essa dinâmica.",
      "Prefiro conversas que tragam paz, não confusão.",
      "Meu tempo é precioso e escolho investir onde há clareza.",
      "Gosto de transparência. Se não for assim, prefiro não seguir.",
      "Não aceito menos do que reciprocidade e respeito pelo meu espaço."
    ],
    "Reengajamento": [
      "Como tem sido sua semana?",
      "Apareceu uma oportunidade legal e lembrei do seu interesse nisso.",
      "Faz tempo que não trocamos uma ideia real. Tudo bem?",
      "O que você tem feito de bom ultimamente?",
      "Vi que você postou algo legal hoje, parabéns pelo movimento!"
    ]
  },
  "categoryInsights": {
    "investimento": {
      "name": "Investimento Estrutural",
      "insight": "A falta de planos futuros indica que ele pode estar vivendo apenas o 'agora', sem intenção de construir algo sólido."
    },
    "consistencia": {
      "name": "Consistência Emocional",
      "insight": "A instabilidade nas respostas cria um ciclo de ansiedade em você. O interesse real é constante, não intermitente."
    },
    "prioridade": {
      "name": "Nível de Prioridade",
      "insight": "Se você é sempre o plano B ou de última hora, ele não está dando o espaço que você merece na vida dele."
    },
    "reciprocidade": {
      "name": "Equilíbrio de Troca",
      "insight": "Você está carregando o piano sozinha. Uma relação saudável precisa de dois motores funcionando."
    }
  },
  "expandedResults": {
    "low": {
      "title": "Radar em Equilíbrio",
      "text": "Sua relação apresenta sinais saudáveis de investimento e reciprocidade. Continue observando para manter essa dinâmica.",
      "plan": [
        { "id": "p1", "title": "Manter Autonomia", "action": "Foco em você", "description": "Continue investindo em seus hobbies e amizades fora da relação." }
      ]
    },
    "medium": {
      "title": "Alerta de Oscilação",
      "text": "Existem inconsistências que precisam de atenção. O radar detectou padrões de afastamento ou falta de iniciativa clara.",
      "plan": [
        { "id": "p2", "title": "Recuo Estratégico", "action": "Espaço", "description": "Diminua sua iniciativa em 30% e observe se ele ocupa o espaço deixado." }
      ]
    },
    "high": {
      "title": "Alto Risco / Alerta",
      "text": "O radar indica um desequilíbrio crítico. Você está investindo muito mais do que recebe, o que gera exaustão emocional.",
      "plan": [
        { "id": "p3", "title": "Silêncio de Ouro", "action": "Proteção", "description": "Pare de puxar assunto ou sugerir planos. Deixe que a realidade se mostre sem sua ajuda." }
      ]
    }
  },
  "theory": {
    "explanation": "O Radar baseia-se na teoria do investimento emocional e na análise de padrões de apego.",
    "references": [
      { "author": "Amir Levine", "note": "Especialista em estilos de apego e segurança nas relações." }
    ]
  },
  "audioScripts": [
    { "id": "a1", "title": "O Poder do Silêncio", "premium": true },
    { "id": "a2", "title": "Como dar Limites", "premium": true }
  ]
}
