
{
  "quiz": {
    "questions": [
      { "id": "q1", "text": "Ele inclui você em planos de médio ou longo prazo?", "category": "investimento", "weight": 3, "reverse": true },
      { "id": "q2", "text": "Ele demonstra iniciativa para marcar encontros?", "category": "investimento", "weight": 2, "reverse": true },
      { "id": "q3", "text": "As respostas às suas mensagens são rápidas e consistentes?", "category": "consistencia", "weight": 2, "reverse": true },
      { "id": "q4", "text": "Você sente que precisa puxar a energia da relação?", "category": "reciprocidade", "weight": 3, "reverse": false },
      { "id": "q5", "text": "Ele compartilha detalhes da rotina espontaneamente?", "category": "reciprocidade", "weight": 2, "reverse": true },
      { "id": "q6", "text": "Ele demonstra curiosidade genuína sobre sua vida?", "category": "reciprocidade", "weight": 2, "reverse": true },
      { "id": "q7", "text": "Ele mantém contato mesmo quando está ocupado?", "category": "consistencia", "weight": 2, "reverse": true },
      { "id": "q8", "text": "Ele demonstra desconforto quando você reduz levemente a disponibilidade?", "category": "reciprocidade", "weight": 2, "reverse": true },
      { "id": "q9", "text": "Ele demonstra orgulho ao ser visto com você?", "category": "prioridade", "weight": 2, "reverse": true },
      { "id": "q10", "text": "Ele propõe planos com antecedência ou sempre decide na última hora?", "category": "prioridade", "weight": 3, "reverse": true },
      { "id": "q11", "text": "Ele demonstra esforço quando percebe que pode te perder?", "category": "investimento", "weight": 3, "reverse": true },
      { "id": "q12", "text": "Você sente imprevisibilidade constante na atitude dele?", "category": "consistencia", "weight": 3, "reverse": false }
    ],
    "answerScores": {
      "yes": 100,
      "sometimes": 50,
      "no": 0
    }
  },
  "expandedResults": {
    "low": {
      "title": "Equilíbrio Estratégico",
      "text": "Sua dinâmica atual apresenta baixo risco. Há sinais claros de interesse e uma estrutura de reciprocidade saudável. O foco agora é manter a autonomia e não acelerar o processo desnecessariamente.",
      "plan": [
        { "id": "p1", "title": "Manutenção da Autonomia", "action": "ESPAÇO", "description": "Continue investindo em seus projetos pessoais para manter o valor percebido alto." },
        { "id": "p2", "title": "Validação Positiva", "action": "REFORÇO", "description": "Retribua iniciativas de forma proporcional, sem exceder o investimento dele." }
      ]
    },
    "medium": {
      "title": "Atenção Tática",
      "text": "Existem oscilações que exigem atenção. O radar detectou pontos de interrogação na consistência ou no investimento. É o momento de observar mais e agir menos, deixando que ele preencha os espaços vazios.",
      "plan": [
        { "id": "p3", "title": "Recuo Estratégico", "action": "OBSERVAÇÃO", "description": "Reduza sua disponibilidade em 20% e observe se ele aumenta o esforço para te alcançar." },
        { "id": "p4", "title": "Quebra de Padrão", "action": "MISTÉRIO", "description": "Pare de ser a primeira a iniciar conversas por 3 dias seguidos." }
      ]
    },
    "high": {
      "title": "Alto Risco / Alerta",
      "text": "O radar indica um desequilíbrio crítico. Você está investindo muito mais do que recebe, o que gera perda de valor e ansiedade. É necessário um choque de realidade e um reposicionamento imediato de postura.",
      "plan": [
        { "id": "p5", "title": "Desconexão Total Temporária", "action": "PODER", "description": "Entre em modo 'Ghosting Estratégico'. Não visualize ou responda instantaneamente. Recupere seu centro." },
        { "id": "p6", "title": "Reativação de Contatos", "action": "VALOR", "description": "Saia com amigas e poste algo que mostre que sua felicidade não depende da validação dele." }
      ]
    }
  },
  "categoryInsights": {
    "investimento": {
      "name": "Investimento",
      "insight": "O ponto mais fraco é o Investimento. Ele não está projetando futuro ou colocando energia real para construir algo sólido. Sem investimento, a relação é apenas conveniência."
    },
    "consistencia": {
      "name": "Consistência",
      "insight": "A Consistência está em alerta. Comportamento montanha-russa gera dependência emocional. Ele aparece e some, o que indica que ele está testando seu limite de espera."
    },
    "prioridade": {
      "name": "Prioridade",
      "insight": "Você não é a Prioridade. Planos de última hora e falta de orgulho público indicam que você está sendo mantida em uma 'reserva estratégica' enquanto ele decide outras opções."
    },
    "reciprocidade": {
      "name": "Reciprocidade",
      "insight": "Falta Reciprocidade. Você está carregando o piano sozinha. Esse esforço unilateral é exaustivo e comunica que você aceita migalhas em troca de atenção."
    }
  },
  "templates": {
    "Curiosidade": [
      "Oi! Vi algo que me lembrou de uma conversa nossa, mas depois te conto. Boa semana!",
      "Achei curioso aquilo que você disse... enfim, focado aqui agora. Falamos depois."
    ],
    "Distância": [
      "Oi! Estou com a semana bem corrida por aqui, depois nos falamos com calma!",
      "Vou dar uma sumidinha para focar nuns projetos, mas está tudo bem por aqui. Beijo!"
    ],
    "Limite": [
      "Eu adoro nossos momentos, mas planos de última hora ficam difíceis para mim. Vamos marcar com antecedência?",
      "Prefiro conversas que fluem dos dois lados. Quando estiver menos ocupado, me avisa."
    ],
    "Reengajamento": [
      "Apareceu um convite para aquele lugar que comentamos... lembrei de você. Como estão as coisas?",
      "Passei por aqui e lembrei daquela música. Espero que esteja tudo bem!"
    ]
  },
  "audioScripts": [
    { "id": "a1", "title": "O Tom da Voz de Escassez", "premium": false },
    { "id": "a2", "title": "Como soar ocupada e feliz", "premium": true },
    { "id": "a3", "title": "A resposta perfeita para o 'Sumido'", "premium": true }
  ],
  "theory": {
    "explanation": "Baseado na Teoria do Investimento de Rusbult e nos princípios de Escassez Psicológica aplicados à dinâmica de alto valor.",
    "references": [
      { "author": "Caryl Rusbult", "note": "Modelo de Investimento nas Relações Interpessoais." },
      { "author": "Robert Cialdini", "note": "Princípios de Influência e Reciprocidade." }
    ]
  }
}
